---
kind: method
id: M:Autodesk.Revit.DB.ColorFillSchemeEntry.Dispose
source: html/63d28a75-9755-cbf0-e06f-81f86b421251.htm
---
# Autodesk.Revit.DB.ColorFillSchemeEntry.Dispose Method

Releases all resources used by the ColorFillSchemeEntry

## Syntax (C#)
```csharp
public void Dispose()
```